controllers/PembelianController.php

SELECT `nama_barang` AS `value`, `nama_barang` AS `label`, `kd_barang` AS `id` FROM `file_barang` WHERE (`nama_barang` LIKE '%para%') AND (`aktif`=1)
---
    public function actionAutocompletebarang($term){
        $data = FileBarang::find()
        ->select(['nama_barang as value', 'nama_barang as  label','kd_barang as id'])
        ->where(['like', 'nama_barang', $term])
        ->andWhere(['aktif'=>1])
        ->asArray()
        ->all();