controllers/PembelianController.php

    public function actionCreate()
    {
        $session = new Session;
        $session->open();

        unset($session['datapembelian']);

        $model = new HeaderPembelian();
        $model->tgl_pembelian = date('Y-m-d');

        $data = FileBarang::find()
        ->select(['nama_barang as value', 'nama_barang as  label','kd_barang as id'])
        ->where(['aktif'=>1])
        ->asArray()
        ->all();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
SELECT `nama_barang` AS `value`, `nama_barang` AS `label`, `kd_barang` AS `id` FROM `file_barang` WHERE `aktif`=1

    public function actionAutocompletebarang($term){
        $data = FileBarang::find()
        ->select(['nama_barang as value', 'nama_barang as  label','kd_barang as id'])
        ->where(['like', 'nama_barang', $term])
        ->andWhere(['aktif'=>1])
        ->asArray()
        ->all();
---
SELECT `nama_barang` AS `value`, `nama_barang` AS `label`, `kd_barang` AS `id` FROM `file_barang` WHERE (`nama_barang` LIKE '%para%') AND (`aktif`=1)