controllers/SiteController.php

SELECT * FROM `hd_transaksi` WHERE `id`='110'
---
    public function actionResumetransaksi($id){
        $model = HdTransaksi::findOne($id);