controllers/SiteController.php

INSERT INTO `hd_transaksi` (`no_transaksi`, `tgl_bayar`, `status_bayar`, `total`, `jumlah_bayar`) VALUES ('202004013', '2020-04-01 13:44:35', 1, 60000, 100000)
INSERT INTO `dt_transaksi` (`no_transaksi`, `kd_barang`, `harga_satuan`, `qty`, `total_harga`, `id_stok_barang`) VALUES ('202004013', 'A0001', 12000, 5, 60000, 3)
---
    public function actionSimpantransaksi(){
        $total_tagihan = $_POST['totaltagihan'];
        $total_bayar = $_POST['totalbayar'];
        $cashback = $_POST['cashback'];

        $session = new Session;
        $session->open();

        $return = array();
        $arr_item = array();

        $model = new HdTransaksi;
        $model->no_transaksi = Utility::getNoTransaksi(1);
        $model->tgl_bayar = date('Y-m-d H:i:s');
        $model->status_bayar = 1;
        $model->total = $total_tagihan;
        $model->jumlah_bayar = $total_bayar;
        if($model->save()){
            if(isset($session['datatransaksi']) && !empty($session['datatransaksi'])){
                foreach($session['datatransaksi'] as $key=>$value){
                    $nama_barang = FileBarang::find()->where(['kd_barang'=>$value['kodebarang']])->one();
                    $arr_item[] = $nama_barang->nama_barang.' : '.$value['qty'].' item';
                    $detail = new DtTransaksi;
                    $detail->no_transaksi = $model->no_transaksi;
                    $detail->kd_barang = $value['kodebarang'];
                    $detail->harga_satuan = $value['harga'];
                    $detail->qty = $value['qty'];
                    $detail->total_harga = $value['harga'] * $value['qty'];
                    $detail->id_stok_barang = $value['idstok'];
                    $detail->save();