components/Utility.php

SELECT * FROM `urutan_transaksi` WHERE DATE(tgl_transaksi)='2020-04-01'
UPDATE `urutan_transaksi` SET `urutan`=3 WHERE `id`=46
---
    public static function getNoTransaksi($id_type){
    	if($id_type == 1){ //no transaksi penjualan
    		$urutan = UrutanTransaksi::find()->where(['DATE(tgl_transaksi)'=>date('Y-m-d')])->one();

    		if($urutan == null){
    			$new_urut = new UrutanTransaksi;
    			$new_urut->nama_transaksi = 'transaksi penjualan';
    			$new_urut->urutan = 1;
    			$new_urut->tgl_transaksi = date('Y-m-d H:i:s');
    			if($new_urut->save()){
    				$return = date('Ymd').$new_urut->urutan;
    			}
    		}else{
    			$return = date('Y').date('m').date('d').$urutan->urutan;

	    		$urutan->urutan = $urutan->urutan + 1;
	    		$urutan->save(false);