models/AppUser.php

    public static function findIdentity($id){
        return AppUser::findOne($id);
---
SELECT * FROM `user` WHERE `id`=3

    public static function findByUsername($username){
        return AppUser::findOne(['username'=>$username]);
---
SELECT * FROM `user` WHERE `username`='admin'