models/HeaderPembelian.php

    public function getItemPembelian($id){
        $model = DetailPembelian::find()->where(['id_pembelian'=>$id])->all();
---
SELECT * FROM `detail_pembelian` WHERE `id_pembelian`=29